# replace Function

In [7]:
import pandas as pd

var2 = pd.read_csv("C:\\Users\\USER\\Documents\\Pandas in Python\\CSV FILE1")
var3 = var2.replace(to_replace = "Om",value = "Sam")

# Here we can replace any value inside the database using above syntax
var3

       Name  Age  Weight
0  Siddhant   20      55
1   Santosh   21      56
2       Sam   21      54
3       Sai   23      67

In [11]:
var4 = var2.replace("Siddhant","Kavya",regex = True)   # Another method for replacing
var4

      Name  Age  Weight
0    Kavya   20      55
1  Santosh   21      56
2       Om   21      54
3      Sai   23      67

# interplolate Function

In [7]:
import pandas as pd
var5 = pd.read_csv("C:\\Users\\USER\\Documents\\Pandas in Python\\CSV FILE1")

# Here this function is used to change the null values based on the previous values but they are not same

var5.interpolate()

       Name  Age  Weight
0  Siddhant   20      55
1   Santosh   21      56
2        Om   21      54
3       Sai   23      67